In [1]:
import numpy as np
import pandas as pd

In [11]:
data = {'Company':['GOOG','GOOG','MSTF','MSTF','FB','FB'],
        'Person':['Sam','Chalie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [18]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Chalie    120
2    MSTF      Amy    340
3    MSTF  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### GroupBy

In [19]:
by_com = df.groupby('Company')

In [20]:
by_com.mean()

/var/folders/y5/87l_bvyd22j00dz0tp43z_t80000gn/T/ipykernel_97573/108984452.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_com.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSTF     232.0

In [21]:
by_com.sum()

/var/folders/y5/87l_bvyd22j00dz0tp43z_t80000gn/T/ipykernel_97573/253971600.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_com.sum()

         Sales
Company
FB         593
GOOG       320
MSTF       464

In [22]:
by_com.std()

/var/folders/y5/87l_bvyd22j00dz0tp43z_t80000gn/T/ipykernel_97573/618873498.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_com.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSTF     152.735065

In [26]:
by_com.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSTF      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [27]:
by_com.describe().transpose()

Company              FB        GOOG        MSTF
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000